RetronixTechInc/android-retronix/vendor/nxp/mcu-sdk-auto/SDK_MEK-MIMX8QX/boards/mekmimx8qx/demo_apps/rear_view_camera/pin_mux.h
/* CSI_D07 (number AM28), BB_CSI_D7(TAMP_IN2)/J13B[32] */
#define BOARD_INITPINS_BB_CSI_D7_PERIPHERAL                           CI_PI__CSI   /*!< Device name: CI_PI__CSI */
#define BOARD_INITPINS_BB_CSI_D7_SIGNAL                                    csi_d   /*!< CI_PI__CSI signal: csi_d */
#define BOARD_INITPINS_BB_CSI_D7_CHANNEL                                      09   /*!< CI_PI__CSI csi_d channel: 09 */
#define BOARD_INITPINS_BB_CSI_D7_PIN_NAME                                CSI_D07   /*!< Pin name */
#define BOARD_INITPINS_BB_CSI_D7_PIN_FUNCTION_ID                    SC_P_CSI_D07   /*!< Pin function id */
#define BOARD_INITPINS_BB_CSI_D7_LABEL            "BB_CSI_D7(TAMP_IN2)/J13B[32]"   /*!< Label */
#define BOARD_INITPINS_BB_CSI_D7_NAME                                "BB_CSI_D7"   /*!< Identifier name */

/* CSI_PCLK (number AK26), BB_CSI_PCLK/J13C[47] */
#define BOARD_INITPINS_BB_CSI_PCLK_PERIPHERAL                         CI_PI__CSI   /*!< Device name: CI_PI__CSI */
#define BOARD_INITPINS_BB_CSI_PCLK_SIGNAL                               csi_pclk   /*!< CI_PI__CSI signal: csi_pclk */
#define BOARD_INITPINS_BB_CSI_PCLK_PIN_NAME                             CSI_PCLK   /*!< Pin name */
#define BOARD_INITPINS_BB_CSI_PCLK_PIN_FUNCTION_ID                 SC_P_CSI_PCLK   /*!< Pin function id */
#define BOARD_INITPINS_BB_CSI_PCLK_LABEL                  "BB_CSI_PCLK/J13C[47]"   /*!< Label */
#define BOARD_INITPINS_BB_CSI_PCLK_NAME                            "BB_CSI_PCLK"   /*!< Identifier name */

/* CSI_MCLK (number AM26), BB_CSI_MCLK/J13E[38] */
#define BOARD_INITPINS_BB_CSI_MCLK_PERIPHERAL                         CI_PI__CSI   /*!< Device name: CI_PI__CSI */
#define BOARD_INITPINS_BB_CSI_MCLK_SIGNAL                               csi_mclk   /*!< CI_PI__CSI signal: csi_mclk */
#define BOARD_INITPINS_BB_CSI_MCLK_PIN_NAME                             CSI_MCLK   /*!< Pin name */
#define BOARD_INITPINS_BB_CSI_MCLK_PIN_FUNCTION_ID                 SC_P_CSI_MCLK   /*!< Pin function id */
#define BOARD_INITPINS_BB_CSI_MCLK_LABEL                  "BB_CSI_MCLK/J13E[38]"   /*!< Label */
#define BOARD_INITPINS_BB_CSI_MCLK_NAME                            "BB_CSI_MCLK"   /*!< Identifier name */

/* CSI_HSYNC (number AR29), BB_CSI_HSYNC(TAMP_IN3)/J13B[33] */
#define BOARD_INITPINS_BB_CSI_HSYNC_PERIPHERAL                        CI_PI__CSI   /*!< Device name: CI_PI__CSI */
#define BOARD_INITPINS_BB_CSI_HSYNC_SIGNAL                             csi_hsync   /*!< CI_PI__CSI signal: csi_hsync */
#define BOARD_INITPINS_BB_CSI_HSYNC_PIN_NAME                           CSI_HSYNC   /*!< Pin name */
#define BOARD_INITPINS_BB_CSI_HSYNC_PIN_FUNCTION_ID               SC_P_CSI_HSYNC   /*!< Pin function id */
#define BOARD_INITPINS_BB_CSI_HSYNC_LABEL      "BB_CSI_HSYNC(TAMP_IN3)/J13B[33]"   /*!< Label */
#define BOARD_INITPINS_BB_CSI_HSYNC_NAME                          "BB_CSI_HSYNC"   /*!< Identifier name */

/* CSI_VSYNC (number AL27), BB_CSI_VSYNC(TAMP_IN4)/J13E[49] */
#define BOARD_INITPINS_BB_CSI_VSYNC_PERIPHERAL                        CI_PI__CSI   /*!< Device name: CI_PI__CSI */
#define BOARD_INITPINS_BB_CSI_VSYNC_SIGNAL                             csi_vsync   /*!< CI_PI__CSI signal: csi_vsync */
#define BOARD_INITPINS_BB_CSI_VSYNC_PIN_NAME                           CSI_VSYNC   /*!< Pin name */
#define BOARD_INITPINS_BB_CSI_VSYNC_PIN_FUNCTION_ID               SC_P_CSI_VSYNC   /*!< Pin function id */
#define BOARD_INITPINS_BB_CSI_VSYNC_LABEL      "BB_CSI_VSYNC(TAMP_IN4)/J13E[49]"   /*!< Label */
#define BOARD_INITPINS_BB_CSI_VSYNC_NAME                          "BB_CSI_VSYNC"   /*!< Identifier name */


/* CSI_RESET (number AR27), BB_CSI_RST_B/J13E[37] */
#define BOARD_INITPINS_BB_CSI_RST_B_GPIO                             LSIO__GPIO3   /*!< GPIO device name: LSIO__GPIO3 */
#define BOARD_INITPINS_BB_CSI_RST_B_GPIO_PIN                                  3U   /*!< LSIO__GPIO3 pin index: 3 */
#define BOARD_INITPINS_BB_CSI_RST_B_PIN_NAME                           CSI_RESET   /*!< Pin name */
#define BOARD_INITPINS_BB_CSI_RST_B_PIN_FUNCTION_ID               SC_P_CSI_RESET   /*!< Pin function id */
#define BOARD_INITPINS_BB_CSI_RST_B_LABEL                "BB_CSI_RST_B/J13E[37]"   /*!< Label */
#define BOARD_INITPINS_BB_CSI_RST_B_NAME                          "BB_CSI_RST_B"   /*!< Identifier name */
/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 * @param ipc scfw ipchandle.
 *
 */
void BOARD_InitPins(sc_ipc_t ipc);                         /*!< Function assigned for the core: Cortex-M4F[m4] */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
